dataframe에서 행/열 삭제

In [1]:
#모듈 로딩
import pandas as pd

In [2]:
#데이터 준비
data={'name':['홍길동','마징가','원더우먼'],
      'job':['의적','로봇','영웅'],
      'gender':['남','남','여'],
      'age':[100,200,300],
      'height':[180,300,200]}

In [3]:
#df로 데이터 저장
datadf=pd.DataFrame(data)
datadf

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

행 삭제: 변수명.drop() => 원본 변경

       : 변수명.drop(labels,axis=0) <- axis의 설정 값에 따라 행/열 삭제 진행
       
       : 변수명.drop(index) <-지정된 인덱스의 행 삭제

In [4]:
#'마징가'행 삭제
datadf.drop(1)

   name job gender  age  height
0   홍길동  의적      남  100     180
2  원더우먼  영웅      여  300     200

In [5]:
datadf

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

In [6]:
#2개 행 삭제
datadf.drop([0,2])

  name job gender  age  height
1  마징가  로봇      남  200     300

열 삭제: 변수명.drop(     ,axis=1/columns) => 원본 변경 X/삭제 방향 지정 필요

       : 변수명.drop(labels,axis=1) <- axis의 설정 값에 따라 행/열 삭제 진행
       
       : 변수명.drop(columns) <-지정된 인덱스의 행 삭제

In [7]:
#age column 삭제
datadf.drop('age',axis=1)

   name job gender  height
0   홍길동  의적      남     180
1   마징가  로봇      남     300
2  원더우먼  영웅      여     200

In [9]:
datadf.drop('age',axis='columns')

   name job gender  height
0   홍길동  의적      남     180
1   마징가  로봇      남     300
2  원더우먼  영웅      여     200

In [11]:
#2개 열 삭제
datadf.drop(['gender','height'],axis=1)

   name job  age
0   홍길동  의적  100
1   마징가  로봇  200
2  원더우먼  영웅  300

In [13]:
datadf.drop(datadf.columns[1:3],axis=1)

   name  age  height
0   홍길동  100     180
1   마징가  200     300
2  원더우먼  300     200

In [14]:
datadf.drop(columns=datadf.columns[1:3])

   name  age  height
0   홍길동  100     180
1   마징가  200     300
2  원더우먼  300     200

In [16]:
datadf.drop([1:3],axis=1)

SyntaxError: invalid syntax (4139776657.py, line 1)